<p style="text-align:center">
    <a href="https://skills.network" target="_blank">
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/assets/logos/SN_web_lightmode.png" width="200" alt="Skills Network Logo">
    </a>
</p>

<h1 align=center><font size = 5>Hands-on Lab: SQL Workbook for Final Assignment</font></h1>

## Introduction
In this lab, you will:

1. Understand the Spacex dataset.
2. Load the dataset into the appropriate database table.
3. Execute SQL queries to answer project-related questions from a different perspective.

## Dataset Summary

SpaceX has garnered worldwide attention for a number of historic milestones.

It is the only private company to successfully return a spacecraft from low orbit, which it first achieved in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website at a cost of $62 million, while other providers cost upwards of $165 million each. Much of the savings is due to SpaceX being able to reuse the first stage.

Therefore, if we can determine whether the first stage will land, we can determine the cost of the launch.

This information can be used if another company wants to bid against SpaceX for a rocket launch.

This dataset includes a record of every payload carried during a SpaceX mission to outer space.

### We will download the dataset

This task requires us to upload the SpaceX dataset.

In many cases, the dataset we will analyze will be available as a .CSV (comma-separated values) file, possibly online. Click the following link to download and save the dataset (.CSV file):

<a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv" target="_blank">SpaceX dataset</a>

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [ ]:
%pip install ipython-sql
%pip install ipython-sql prettytable

In [1]:
%load_ext sql

In [8]:
import csv, sqlite3
import prettytable
prettytable.DEFAULT = 'DEFAULT'

con = sqlite3.connect("my_data1.db")
cur = con.cursor()

In [9]:
%sql sqlite:///my_data1.db

In [10]:
import pandas as pd
df = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv")
df.to_sql("SPACEXTBL", con, if_exists='replace', index=False,method="multi")

101

**Eliminarmos filas en blanco de la tabla**

In [9]:
#DROP THE TABLE IF EXISTS

%sql DROP TABLE IF EXISTS SPACEXTABLE;

 * sqlite:///my_data1.db
Done.

[]

In [10]:
%sql create table SPACEXTABLE as select * from SPACEXTBL where Date is not null

 * sqlite:///my_data1.db
Done.

[]

## Tasks

Now we will write and execute SQL queries to solve some assigned questions.

### Task 1

##### We will display the names of the unique launch sites for the space mission.

In [11]:
%sql SELECT DISTINCT "Launch_Site" FROM SPACEXTABLE;

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40',), ('VAFB SLC-4E',), ('KSC LC-39A',), ('CCAFS SLC-40',)]

## Task 2

We will display 5 records where the launch sites begin with the string "CCA"

In [12]:
%sql SELECT * FROM SPACEXTABLE WHERE "Launch_Site" LIKE 'CCA%' LIMIT 5;

 * sqlite:///my_data1.db
Done.

[('2010-06-04', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 ('2010-12-08', '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 ('2012-05-22', '7:44:00', 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'),
 ('2012-10-08', '0:35:00', 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 ('2013-03-01', '15:10:00', 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt')]

### Task 3

We will show the total payload mass carried by NASA-launched rockets (CRS).

In [13]:
%sql SELECT SUM(PAYLOAD_MASS__KG_) AS 'PAYLOAD IN KG' FROM SPACEXTABLE WHERE Customer = 'NASA (CRS)';

 * sqlite:///my_data1.db
Done.

[(45596,)]

## Task 4

We will show the average payload mass carried by the F9 v1.1 booster rocket.

In [14]:
%sql SELECT AVG(PAYLOAD_MASS__KG_) AS 'AVERAGE PAYLOAD IN KG' FROM SPACEXTABLE WHERE Booster_Version = 'F9 v1.1';

 * sqlite:///my_data1.db
Done.

[(2928.4,)]

## Task 5
We will indicate the date of the first successful landing on the platform.

In [15]:
%%sql
SELECT MIN(Date) AS 'First successful landing on the platform'
FROM SPACEXTABLE
WHERE Landing_Outcome LIKE 'Success%';

 * sqlite:///my_data1.db
Done.

[('2015-12-22',)]

## Task 6

We will list the names of successful propellants used in unmanned spacecraft with payloads greater than 4000 but less than 6000.

In [28]:
%%sql
SELECT 
    ROW_NUMBER() OVER (ORDER BY Booster_Version) AS num,
    Booster_Version,
    PAYLOAD_MASS__KG_ AS Weight_kg
FROM SPACEXTABLE
WHERE (4000 < PAYLOAD_MASS__KG_ AND PAYLOAD_MASS__KG_ < 6000)
  AND Landing_Outcome LIKE 'Success%';

 * sqlite:///my_data1.db
Done.

[(1, 'F9 B4 B1040.1', 4990),
 (2, 'F9 B4 B1043.1', 5000),
 (3, 'F9 B5 B1046.2', 5800),
 (4, 'F9 B5 B1047.2', 5300),
 (5, 'F9 B5 B1048.3', 4850),
 (6, 'F9 B5 B1051.2 ', 4200),
 (7, 'F9 B5 B1058.2 ', 5500),
 (8, 'F9 B5B1060.1', 4311),
 (9, 'F9 B5B1062.1', 4311),
 (10, 'F9 FT  B1021.2', 5300),
 (11, 'F9 FT  B1031.2', 5200),
 (12, 'F9 FT B1022', 4696),
 (13, 'F9 FT B1026', 4600),
 (14, 'F9 FT B1032.1', 5300)]

## Task 7

We will list the total number of successful and failed mission outcomes.

In [21]:
%%sql

SELECT SUM(Landing_Outcome LIKE 'Success%') AS 'Total successful landings',
        SUM(Landing_Outcome LIKE 'Failure%') AS 'Total failed landings'
FROM SPACEXTABLE

 * sqlite:///my_data1.db
Done.

[(61, 10)]

## Task 8

We will list all booster_versions that have carried the maximum payload, using a subquery.

In [23]:
%%sql
SELECT 
    ROW_NUMBER() OVER (ORDER BY Booster_Version) AS num,
    Booster_Version,
    PAYLOAD_MASS__KG_ AS Carga_Maxima_Kg
FROM SPACEXTABLE
WHERE PAYLOAD_MASS__KG_ = (
    SELECT MAX(PAYLOAD_MASS__KG_) 
    FROM SPACEXTABLE
);

 * sqlite:///my_data1.db
Done.

[(1, 'F9 B5 B1048.4', 15600),
 (2, 'F9 B5 B1048.5', 15600),
 (3, 'F9 B5 B1049.4', 15600),
 (4, 'F9 B5 B1049.5', 15600),
 (5, 'F9 B5 B1049.7 ', 15600),
 (6, 'F9 B5 B1051.3', 15600),
 (7, 'F9 B5 B1051.4', 15600),
 (8, 'F9 B5 B1051.6', 15600),
 (9, 'F9 B5 B1056.4', 15600),
 (10, 'F9 B5 B1058.3 ', 15600),
 (11, 'F9 B5 B1060.2 ', 15600),
 (12, 'F9 B5 B1060.3', 15600)]

### Task 9

##### List the records that will show the month names, failed drone landing results, booster versions, and launch site for the months of 2015.

In [40]:
%%sql
SELECT 
  substr(Date,6,2) AS month,
  Customer AS customers,
  Booster_Version AS version,
  Launch_Site AS site,
  Landing_Outcome AS outcome,
  PAYLOAD_MASS__KG_ AS payload
FROM SPACEXTABLE
WHERE Landing_Outcome = 'Failure (drone ship)'
  AND substr(Date,0,5)='2015';

 * sqlite:///my_data1.db
Done.

[('01', 'NASA (CRS)', 'F9 v1.1 B1012', 'CCAFS LC-40', 'Failure (drone ship)', 2395),
 ('04', 'NASA (CRS)', 'F9 v1.1 B1015', 'CCAFS LC-40', 'Failure (drone ship)', 1898)]

## Task 10

Order the number of landings (as failure (drone) or success (ground platform)) between June 4, 2010, and March 20, 2017, in descending order.

In [39]:
%%sql

SELECT 
    Landing_Outcome,
    COUNT(*) AS Number_Landings
FROM SPACEXTABLE
WHERE Date BETWEEN '2010-06-04' AND '2017-03-20'
GROUP BY Landing_Outcome
ORDER BY Number_Landings DESC;

 * sqlite:///my_data1.db
Done.

[('No attempt', 10),
 ('Success (drone ship)', 5),
 ('Failure (drone ship)', 5),
 ('Success (ground pad)', 3),
 ('Controlled (ocean)', 3),
 ('Uncontrolled (ocean)', 2),
 ('Failure (parachute)', 2),
 ('Precluded (drone ship)', 1)]

We close the connection once this laboratory is finished.

In [11]:
con.close()

<br>

-------------------------------

### Reference Links

* <a href ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20String%20Patterns%20-%20Sorting%20-%20Grouping/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : String Patterns, Sorting and Grouping</a>  

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Built-in%20functions%20/Hands-on_Lab__Built-in_Functions.md.html?origin=www.coursera.org">Hands-on Lab: Built-in functions</a>

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : Sub-queries and Nested SELECT Statements</a>

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-3-SQLmagic.ipynb">Hands-on Tutorial: Accessing Databases with SQL magic</a>

*  <a href= "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-4-Analyzing.ipynb">Hands-on Lab: Analyzing a real World Data Set</a>

## Author(s)

<h4> Lakshmi Holla </h4>

## Other Contributors

<h4> Rav Ahuja </h4>

<!--
## Change log
| Date | Version | Changed by | Change Description |
|------|--------|--------|---------|
| 2024-07-10 | 1.1 |Anita Verma | Changed Version|
| 2021-07-09 | 0.2 |Lakshmi Holla | Changes made in magic sql|
| 2021-05-20 | 0.1 |Lakshmi Holla | Created Initial Version |
-->

## <h3 align="center"> © IBM Corporation 2021. All rights reserved. <h3/>